Мы будем говорить в этой книжкее о неприятных случайностях и о том, являются ли они плодом нашего предвзятого отношения к жизни, или объективными явлениями. И в этом разговоре нам понадобится математика. Если спросить человека, далёкого от наук о том, что изучают математики, то скорее всего получим ответ: "числа, ну, или фигуры". Это то, что остаётся после изучения школьной программы. Однако, вопреки распространённому мнению, математики имеют дело не с числами, а с <i>математическими структурами</i>, имеющими чёткие и определённые свойства и с отображениями между ними. К структурам относятся <i>множества, группы, поля, графы, кольца, моноиды, косы, многообразия</i> и великое множество других структур, которыми занимаются алгебра, топология, теория графов, теория категорий и прочие разделы математики. С отображениями мы знакомимся, изучая, например, функции. 

Порой может сложиться ощущение, что математики описывают новые и новые математические структуры лишь для своего удовольствия (и многие математики-профессионалы с этим согласятся). Их результаты абстрактны, часто совершенно непонятны, не нужны в повседневности, но математики открывают их, доказывают какие-то невероятные теоремы, не трудясь объяснять их прикладной смысл. Но когда физик, программист, экономист или социолог приступает к серьёзному исследованию некоторого явления или объекта, он ищет для моделирования своего объекта исследований подходящий объект в математическом мире. Чем можно моделировать массу? Её можно складывать, умножать на число, она не может быть отрицательной... неотрицательного действительного числа вполне достаточно. Что можно делать со скоростью? Тоже складывать и умножать на число, но скорости имеют разные направления, одного числа тут явно недостаточно, нужен иной объект -- <i>вектор</i>. Вектор можно представить отрезком со стрелкой или набором чисел, и то и другое представление образуют алгебру, совпадающую с алгеброй скоростей, значит, можно одним моделировать другое. А если мы моделируем течение воздуха вокруг самолёта, то вместо одного вектора потребуется целое <i>векторное поле</i>. А как моделировать процесс выполнения сложной задачи, управление автоматизированной системой кондиционирования или социальную сеть? Числом, вектором, полем?.. Для этого лучше всего подходит такая структура, как <i>граф</i>, которую можно представить либо в виде диаграммы, состоящей из точек (узлов) и стрелок (рёбер), либо в виде таблицы -- <i>матрицы связности</i>. Языки естественные и искусственные, моделируются <i>формальными грамматиками</i>, вращения -- <i>кватернионами</i> (которые появились на свет как обобщение мнимой единицы), типы в программировании -- <i>полукольцами</i> и так далее и так далее... кажется, самые абстрактные и мудрёные структуры находят себе применение!

А какой структурой моделировать результаты выпадения числа на игральной кости, или уровень воды в реке, ведт на воде постоянное волнение? Как работать с числом автомобилей проезжающих перекрёсток в течение часа? Какой структурой можно описать состояние электрона? С одной стороны, это конкретные числа из вполне определённого множества значений: для кости, например, из множества $inline$\{1,2,3,4,5,6\}$inline$, и это значение легко получить, проведя эксперимент. Однако, повторный эксперимент даст иной результат, это явно не просто число: сегодня оно одно, завтра -- другое. Может даже возникнуть философский вопрос: а имеет ли смысл говорить о каком-то точном значении "уровня воды в реке", или числе автомобилей, ведь эти величины невозможно "поймать" и зафиксировать? 

Понятно, что мы говорим о случайных величинах и о вероятностях, но что это такое? Часто, говоря о таких случайных величинах ограничиваются одним лишь средним значением, но это отличный способ запутаться или даже намеренно запутать. Два числа: среднее и стандартное отклонение уже лучше, но явно это не вся информация об интересующем нас объекте. Может быть, это не числа, а множества? Скажем, уровень моря можно попытаться описать интервалом возможных значений с учётом волнения, для примера с машинами сказать, что за час проезжает от 1 до 100 машин и т.д. Но легко увидеть, что и множества возможных значений тоже не достаточно, например, при многократном повторении измерения числа автомобилей на улице, какие-то числа будут встречаться чаще, а каких-то мы не дождёмся вовсе. 
Если каждому элементу множества допустимых значений поставить в соответствие некое число, отражающее "частоту" его появления в экспериментах, то можно получить полное представление о случайной величине. Это число мы и называем <i>вероятностью</i>. Оно, во-первых, должно быть неотрицательным, а во-вторых, сумма вероятностей для вспх элементов множества значений случайной вличины должна быть равна 1. Таким образом, формально, случайная величина -- это функция, отображение множества возможных значений (Здесь мы несколько упрощаем полное определение, данное А.Н. Колмогоровым, и используемое математиками. В точном определении фигурирует не просто множество, а вероятностное пространство: множество с определённой структурой, называемой сигма-алгеброй. Но для наших целей простого определения вполне достаточно) в множество неотрицательных действительных чисел, такое, что сумма образов для всех элементов множества значений равна единице. Если эта функция определена на дискретном множестве (конечном наборе чисел, например), то она называется <i>функцией вероятности</i>. Если случайная величина может принимать значения из непрерывного множества, то её характеризует <i>плотность вероятности</i>. Эти термины мы будем использовать в книжке постоянно. Кроме того, мы будем употреблять обобщающий термин "распределение вероятностей", который применим как к дискретным, так и непрерывным случайным величинам. Он будет заменять словолочетание: "полная информация о случайной величине".

Функцию можно представить аналитически, в виде таблицы, либо в виде графика. Мы можем теперь описать что такое случайная величина, получаемая при кидании кости: это отображение, ставящее каждому элементу множества $inline$\{1,2,3,4,5,6\}$inline$ число 1/6. Для уровня воды в реке -- это непрерывная функция, график которой можно показать так: 
Интенсивность транспортного потока будет, скорее всего, иметь какой-то вид: Эту функцию можно задать аналитически как $$display$$...$$display$$ 

Таким образом, рассуждая о вероятностях и о распределениях, как о точных результатах, мы ничего не говорим о каком-либо точном значении случайной величины. Но при этом, каждый эксперимент, каждое измерение или наблюдение даст нам какое-то конкретное число. В этом состоит основная сложность восприятия случайности. Всё, что с нами происходит, вполне конкретно и ощутимо. Дождь за окном или идёт или нет, брошенная монета выпадает вполне определённо орлом или решкой. Однако, для полного понимания происходящего нужно оторваться от конкретности и допустить все возможности сразу, только после этого мы получим по-настоящему точный результат: величину, как распределение вероятностей. Но в то же самое время, мы теряем возможность сказать что именно случится в будущем. 

Приведу яркий пример. Вот как выглядит информация, которую предоставляют службы прогноза землетрясений: "Вероятность того, что в течение пяти ближайших лет в каком-то районе произойдёт сильное землетрясение выросла до 40%". Что это значит? Завтра тряхнёт? А когда? Это значит только то, что если мы повторим пятилетний период сто раз, то за пятьсот лет произойдёт около 40 землетрясений. Когда именно -- неизвестно. Это на сегодняшний день, самое точное знание о будущих землетрясениях, но, в тоже время, оно разочаровывает своей неопределённостью. Однако эту информацию необходимо получать и её можно использовать в стратегии развития городов в сейсмоопасных районах.

Величайший математик 19-20 веков Анри Пуанкаре с восторгом писал о теории вероятностей:
Порассуждаем и мы о случайностях в нашей жизни и о том, как можно их постичь.

Наш путь в область этой науки не будет серьёзным, мы не будем доказывать теоремы или давать точные определения. Мы здесь побудем в роли участников экскурсии по городу. Проходя по разным улицам от площади к площади, экскурсанты глазеют на вывески лавочек и величественные дворцы, в равной степени восхищаясь величием правителей и предприимчивостью горожан. Так и мы пробежим по математическим закоулкам для того, чтобы получить представление об этом городе и просто отдохнуть.

...

Он показал, что сами по себе размерности образуют т. н. <i>свободную абелеву группу</i>, а размерные величины -- <i>локально тривиальное расслоение</i>. Я не буду здесь расшифровывать, что означают эти термины, в двух словах это не получится. Пусть для заинтересованного читателя упоминание об алгебраических структурах будет указателем направления, с которого начинается настоящая математика.×

***

На практике и в жизни мы сталкиваемся с этим эффектом при попытках предсказать погоду или просчитать партию логической игры с элементами случайностей. Небольшие отклонения вырастают, и если пространство состояний системы ограничено, то система попадает в хаотический режим, эффективно перемешивая свой <i>фазовый объём</i> -- множество начальных состояний системы. Если в нелинейной динамической системе есть определённого рода неустойчивости, то отклонения возрастают экспоненциально, и такая система может стать хаотичной даже в отсутствии случайностей, заложенных в модель. Такие системы изучает теория динамического хаоса -- очень интересная область математики, показывающая как случайности могут возникать из детерминистических задач и как из хаоса вновь рождается порядок.

Такой хаос может приносить и пользу. Алгоритмы, с помощью которых генерируются случайные числа в компьютерах тоже детерминированы. Для примеров в этой книге, я пользовался генератором псевдослучайных чисел, который не запускал реальный стохастический процесс (альфа-распад, или подсчёт машин на дороге), а вычислял следующее "случайное" число на базе предыдущих, полученных им ранее.

Из наблюдения за тем, как теряется информация о начальных данных запускаемой в полёт монетки, следует ещё один интересный и общий вывод: пресловутый "эффект бабочки" практически не работает. Напомню, что под этим эффектом подразумевается цепочка далеко идущих драматичных последствий от некоторого незначительного, на первый взгляд, события. Раздавленная исследователями прошлого бабочка в рассказе Рея Бредбери "И грянул гром" привела к кардинальной перестройке будущего. На этот эффект мы неявно ссылаемся, сетуя: "Не поверни я за угол, всё было бы по-другому!", "Не сел бы он в этот поезд, не случилось бы катастрофы!" или "Из-за такой мелочи разругались и разошлись!!" Надо понимать, что малые отклонения приводят к кардинальной перестройке системы лишь, если она неустойчива. То есть, если пара распалась из-за ерунды, ей суждено было распасться в любом случае. А если в системе множество параметров, и ряд из них случаен, то информация имеет свойство теряться и уже никак не удастся восстановить в какой именно момент в нашей жизни "всё пошло не так". Только привычка всему находить объяснение призывает нас выделять какой-то "ключевой момент". Впрочем, это уже психология, а туда я обещал не погружаться.

<spoiler title="Что такое вероятность?">
На интуитивном уровне с понятием вероятности знакомы сейчас, практически, все. Её оценивают политологи и журналисты на ток-шоу, её обсуждают говоря о глобальном потеплении или завтрашнем дожде, про неё рассказывают анекдоты
<blockquote>Какова вероятность встретить на Тверской динозавра? -- Одна вторая: либо встречу, либо нет
</blockquote> 
Но мы собираемся идти дальше и рассуждать о таких вещах как <i>плотность вероятности</i> или <i>энтропия распределения</i>. Нужно более или менее строго определить о чём мы говорим, рассуждая о вероятности и случайных величинах.  
Само понятие <i>вероятность</i> определяется как мера на множестве, называемом <i>вероятностным пространством</i>, оно включает в себя как элементарные события, так и их комбинации (объединения и исключения). Вероятность -- это мера. Мера должна быть аддитивной, значит, если мы имеем конечный набор элементарных событий, то при их объединении мы должны получить сумму вероятностей для каждого из них.
У любой меры есть такое свойство: мера пустого множества равна нулю 
</spoiler>


«Все делают общие выводы из одного примера. По крайней мере, я делаю именно так.» — Влад Талтош, «Исола», Стивен Браст

It is as important to decide what a system is not as to decide what it is. 

The only thing worse than generalizing from one example is generalizing from no examples at all.

Isolate complexity as much as possible.

Боб Шифлер и Джим Геттис, разработчики системы оконного интерфейса X Window System, которая используется почти на всех операционных системах семейства Linux, в своё время сформулировали несколько принципов проектирования, оказавшихся универсально полезными. Из них я чаще всего вспоминаю один:<blockquote>Хуже обобщения на одном примере может быть лишь обобщение без примера вовсе</blockquote>

***




Отрицать "объективность" или "реальность" математики столь же нелепо, как спорить в сети Интернет о том, что Земля плоская, пользуясь для этого спутниковой связью -- явлением существующим только благодаря тому, что Земля, подчиняясь законам всемирного тяготения, имеет соответствующую форму. Математику упрекают в идеализации, противопоставляя "настоящему" миру. Однако, мне кажется, что в этом видится идеализация этого самого мира, и наделение его некими чудодейственными свойствами, которые должны позволить ему не подчиняться законам математики. Эти законы если и не являются неотъемлемой частью нашего физического мира, то по крайней мере дают нам единственный способ рассуждать о нём, так, чтобы и спустя сотни лет можно было пользоваться плодами этих рассуждений, предельно точно понимая мысли Пифагора, Аль-Хорезми, Леонарда Эйлера, Давида Гильберта или Анри Пуанкаре.


Все, что изменяет нашу жизнь, — не случайность. Оно в нас самих и ждет лишь внешнего повода для выражения действием.
Александр Сергеевич Грин


Можно подумать, что исследователи обречены на одну из логических ошибок, которая носит звучное латинское имя Ad ignorantiam («к невежеству»). Это аргументация истинности некоторого утверждения, основанная на отсутствии доказательства его ложности. Классический пример — слова, сказанные сенатором Джозефом Маккарти, когда его попросили предъявить факты для поддержки выдвинутого им обвинения, что некий человек является коммунистом: «У меня немного информации по этому вопросу, за исключением того общего заявления компетентных органов, что в его досье нет ничего, чтобы исключало его связи с коммунистами».
Ad


Закон новшества
Если вы хотите, чтобы команда выиграла прыжки в высоту, найдите одного человека, который может прыгнуть на семь футов, а не семь человек, прыгающих каждый на один фут.

Закон Пруткова
Многие вещи непонятны нам не потому, что наши понятия слабы, но потому, что сии вещи не входят в круг наших понятий.

Закон Мартина младшего
Решение проблемы изменяет саму проблему.

